app/controllers/app_controller.rb

SELECT  "noticia".* FROM "noticia"   ORDER BY created_at DESC LIMIT 1
SELECT "contenidos".* FROM "contenidos"
SELECT "nombres".* FROM "nombres"
---
  def index
      @noticia ||= Noticia.all
      @contenido ||= Contenido.all
      @categoria ||= Categoria.all
      @convenio ||= Convenio.all
      @nombre ||= Nombre.all